# FormCreationInvalidGeomCombination Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FormFailures..::..FormCreationInvalidGeomCombination Property
BuiltInFailures..::..FormFailures Class See Also
---
Cannot remake form that is currently cut or joined to other geometry. Please uncut or unjoin first.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FormCreationInvalidGeomCombination { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FormCreationInvalidGeomCombination As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FormCreationInvalidGeomCombination {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FormFailures Class
Autodesk.Revit.DB Namespace